{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Sciences",
      "department": "Bioinformatics and Computational Biology",
      "duration": "2015-2020",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TinaLee",
  "highlighted_projects": [
    {
      "description": "An IOS app that allows users to get live updates on NBA players status during live games. Web scraping was performed to fetch data of all NBA teams, the players belonging to each team, and most importantly the live data updates. All users are allowed to customize their list of players that they want to follow. This project is implemented using React Native.js and Express.js as the backend.",
      "git_url": "https://github.com/weiyuch4/FantasyAlert",
      "name": "Fantasy Alert"
    },
    {
      "description": "A project that demonstrates the workflow to download Pfam families data from the Pfam database, how to map HGNC symbols to Pfam domains, how to annotate the example gene set, and provides examples of computing database statistics. This package serves dual duty, as a Rstudio project, as well as an R package that can be installed.",
      "git_url": "https://github.com/leetina4/BCB420.2019.Pfam",
      "name": "Pfam Data Annotation of Human genes"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Cluster Monitoring Agent that aids Jarvis Linux Cluster Administration (LCA) team in future resource planning. This project is implemented using bash shell scripts to automatically collect hardware specification data and resource usage data of each server. Data will be collected and stored to a Postgres SQL generated by Docker every one-minute using crontab.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Designed a Twitter application with MVC architecture that allows users to perform CRUD functionalities via REST API. Programmed using Twitter API, HTTP client, OAuth authorization, and JSON serialization libraries.",
        "JDBC App: Implemented a simple application that sets up a connection between a Java application and RDBMS for data accessing. The CRUD functionalities are implemented using DAO design patterns.",
        "Grep App: Developed a Java application that mimics the grep command line function. The app recursively searches for a matched pattern given a root directory and outputs matched lines to an output file."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Designed a Java application that simulates an online stock trading platform using microservice and MVC architecture. The application fetches the latest market data from IEX Cloud and stores this information along with trader information in the PostgreSQL database. Users could buy or sell stocks and deposit or withdraw funds from their accounts. This application is managed and packaged by Maven and Spring Boot.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Tina Lee",
  "others": [
    {
      "bullets": [
        "Business IT certificate (2021)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Badminton player",
        "Snowboarding"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked as a Data Engineer and developed projects using technologies, such as Java, Docker, Maven, Springboot, RDBMS, REST API. Collaborated with team members in daily scrum meetings, sprint meetings, and code review sessions with senior developers to get involved in Agile/Scrum practice.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Toronto",
      "description": "Proposed and successfully implemented a tool for processing and analyzing the output of a DNA aligner and summarizing the output by creating a splicing graph to visual patterns. Designed a user-friendly interface application using R and Shiny and performed data analysis using R.",
      "duration": "2019",
      "title": "Research Student"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "JUnit/Mockito",
      "REST API",
      "Spring Boot",
      "MVC architecture"
    ],
    "familiar": [
      "Javascript",
      "React Native",
      "R",
      "Python",
      "Express.js"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "SQL",
      "IntelliJ",
      "Maven"
    ]
  },
  "summary": "I am a new graduate from the University of Toronto with a Bachelor's degree specializing in Bioinformatics. During my university years, I had opportunities to work with professional teams as a research student to build a solid programming foundation and explore my interest in data analysis. Besides, I am also a team player and an effective communicator, who is always responsible and well-organized. Currently, I am working at  Jarvis to improve my skill sets as a data engineer while building challenging projects and applications using new technologies such as Docker, Springboot, Java, Maven, REST API, RDBMS, etc. I would say I am a problem-solver by nature and I am ready to solve challenging problems in our daily lives in the data engineer industry."
}
